In [2]:
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# 1. Series

# make series obj
ser1 = pd.Series(np.arange(1,8),
                index = list('abcdefg'))
ser1
# series is like 1d ndarry , but series have index like dictionary

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int32

In [4]:
# series attributes

In [5]:
ser1.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [6]:
ser1.array

<NumpyExtensionArray>
[1, 2, 3, 4, 5, 6, 7]
Length: 7, dtype: int32

In [7]:
ser1.values

array([1, 2, 3, 4, 5, 6, 7])

In [8]:
ser1.ndim

1

In [9]:
ser1.shape

(7,)

In [10]:
ser1.name = 'ex_ser'
ser1.name

'ex_ser'

In [11]:
ser1.index.name = 'ex_indx'
ser1.index.name

'ex_indx'

In [12]:
# series's attribute is like ndarray's attribute

In [13]:
# series indexing slicing masking ... etc

In [14]:
ser1

ex_indx
a    1
b    2
c    3
d    4
e    5
f    6
g    7
Name: ex_ser, dtype: int32

In [15]:
# series can 
ser1[1]

C:\Users\huynj\AppData\Local\Temp\ipykernel_6448\2003299025.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser1[1]

2

In [16]:
# label indexing
ser1['b']

2

In [17]:
ser1.loc['b']

2

In [18]:
ser1.iloc[1]

2

In [19]:
#fancy indexing
ser1[['a','c']]

ex_indx
a    1
c    3
Name: ex_ser, dtype: int32

In [20]:
# slicing
ser1['d':]

ex_indx
d    4
e    5
f    6
g    7
Name: ex_ser, dtype: int32

In [21]:
ser1.loc[['a','c']]

ex_indx
a    1
c    3
Name: ex_ser, dtype: int32

In [22]:
ser1.iloc[[0,3]]

ex_indx
a    1
d    4
Name: ex_ser, dtype: int32

In [23]:
# masking
ser1>4

ex_indx
a    False
b    False
c    False
d    False
e     True
f     True
g     True
Name: ex_ser, dtype: bool

In [24]:
ser1[ser1>4]

ex_indx
e    5
f    6
g    7
Name: ex_ser, dtype: int32

In [25]:
# series

In [26]:
ser2 = ser1*2
ser2

ex_indx
a     2
b     4
c     6
d     8
e    10
f    12
g    14
Name: ex_ser, dtype: int32

In [27]:
np.add(ser1,ser2)

ex_indx
a     3
b     6
c     9
d    12
e    15
f    18
g    21
Name: ex_ser, dtype: int32

In [28]:
ser3 = pd.Series(np.arange(10,3,-1),
                 index = list('edfghij'))
ser3

e    10
d     9
f     8
g     7
h     6
i     5
j     4
dtype: int32

In [29]:
# if there is no same index 
ser4 = ser1+ser3

In [30]:
#na search method
pd.isna(ser4)
# == ser4.isna()

a     True
b     True
c     True
d    False
e    False
f    False
g    False
h     True
i     True
j     True
dtype: bool

In [31]:
ser4.notna()

a    False
b    False
c    False
d     True
e     True
f     True
g     True
h    False
i    False
j    False
dtype: bool

In [32]:
ser1

ex_indx
a    1
b    2
c    3
d    4
e    5
f    6
g    7
Name: ex_ser, dtype: int32

In [33]:
# index change
ser1.index = list('1234567')
ser1

1    1
2    2
3    3
4    4
5    5
6    6
7    7
Name: ex_ser, dtype: int32

In [34]:
# Series row delete

In [35]:
# not return 
del ser1['1']
ser1

2    2
3    3
4    4
5    5
6    6
7    7
Name: ex_ser, dtype: int32

In [36]:
# return 
ser1 = ser1.drop('3')
ser1

2    2
4    4
5    5
6    6
7    7
Name: ex_ser, dtype: int32

In [37]:
ser1

2    2
4    4
5    5
6    6
7    7
Name: ex_ser, dtype: int32

In [38]:
# etc options
ser1 = ser1.reindex(list('42576'))
ser1

4    4
2    2
5    5
7    7
6    6
Name: ex_ser, dtype: int32

In [58]:
#2. DataFrame

# make dataframe obj

# make DataFrame : same size dicts or series or same size ndim ndarray etc.. 
df1 = {
    '학번' : np.arange(20203300, 20203310),
    '이름' : ['풍유성', '제갈영윤', '설현우', '백태하', '정용성', '허형철', '하주연', '사공재주', '손창희', '유용환'],
    '학점' : np.random.uniform(3, 4.5, 10),
    '성별' : np.random.choice(['남','여'], 10)
}
df1 = pd.DataFrame(df1)
df1.index = list('abcdefghij')
df1

         학번    이름        학점 성별
a  20203300   풍유성  3.004508  여
b  20203301  제갈영윤  3.684356  남
c  20203302   설현우  3.289410  남
d  20203303   백태하  4.065680  남
e  20203304   정용성  3.874291  여
f  20203305   허형철  3.563384  여
g  20203306   하주연  4.101153  남
h  20203307  사공재주  4.306064  여
i  20203308   손창희  4.304477  남
j  20203309   유용환  3.865725  여

In [40]:
# Dataframe attributes

In [41]:
df1.columns.name = 'ex_c_name'
df1.index.name = 'ex_i_name'
df1

ex_c_name        학번    이름        학점 성별
ex_i_name
a          20203300   풍유성  3.532963  여
b          20203301  제갈영윤  4.272661  남
c          20203302   설현우  3.945900  여
d          20203303   백태하  4.396391  여
e          20203304   정용성  4.063440  남
f          20203305   허형철  3.064323  여
g          20203306   하주연  3.554681  여
h          20203307  사공재주  3.617575  여
i          20203308   손창희  3.117372  남
j          20203309   유용환  3.778316  여

In [42]:
df1.columns

Index(['학번', '이름', '학점', '성별'], dtype='object', name='ex_c_name')

In [43]:
df1.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object', name='ex_i_name')

In [97]:
df1.T

,a,b,c,d,e,f,g,h,i,j
학번,20203300,20203301,20203302,20203303,20203304,20203305,20203306,20203307,20203308,20203309
이름,풍유성,제갈영윤,설현우,백태하,정용성,허형철,하주연,사공재주,손창희,유용환
학점,3.854855,4.022433,3.351779,3.278073,4.498294,100.0,100.0,100.0,100.0,4.112367
성별,남,남,남,남,남,여,여,여,여,남

In [44]:
# dataframe's one column is Series
df1['학번']
# == df1.학번

ex_i_name
a    20203300
b    20203301
c    20203302
d    20203303
e    20203304
f    20203305
g    20203306
h    20203307
i    20203308
j    20203309
Name: 학번, dtype: int32

In [45]:
# df's indexing 

# using loc, iloc -> same as ndarray

In [46]:
df1[['학번','성별']]

ex_c_name        학번 성별
ex_i_name
a          20203300  여
b          20203301  남
c          20203302  여
d          20203303  여
e          20203304  남
f          20203305  여
g          20203306  여
h          20203307  여
i          20203308  남
j          20203309  여

In [47]:
df1[:]

ex_c_name        학번    이름        학점 성별
ex_i_name
a          20203300   풍유성  3.532963  여
b          20203301  제갈영윤  4.272661  남
c          20203302   설현우  3.945900  여
d          20203303   백태하  4.396391  여
e          20203304   정용성  4.063440  남
f          20203305   허형철  3.064323  여
g          20203306   하주연  3.554681  여
h          20203307  사공재주  3.617575  여
i          20203308   손창희  3.117372  남
j          20203309   유용환  3.778316  여

In [48]:
df1[df1['학번'] >  20203305]

ex_c_name        학번    이름        학점 성별
ex_i_name
g          20203306   하주연  3.554681  여
h          20203307  사공재주  3.617575  여
i          20203308   손창희  3.117372  남
j          20203309   유용환  3.778316  여

In [49]:
# loc indexer - include *end
df1.loc['a':'d']

ex_c_name        학번    이름        학점 성별
ex_i_name
a          20203300   풍유성  3.532963  여
b          20203301  제갈영윤  4.272661  남
c          20203302   설현우  3.945900  여
d          20203303   백태하  4.396391  여

In [50]:
df1.iloc[0:4]

ex_c_name        학번    이름        학점 성별
ex_i_name
a          20203300   풍유성  3.532963  여
b          20203301  제갈영윤  4.272661  남
c          20203302   설현우  3.945900  여
d          20203303   백태하  4.396391  여

In [51]:
df1.loc['e':'h','학번'] > 20203304

ex_i_name
e    False
f     True
g     True
h     True
Name: 학번, dtype: bool

In [52]:
df1.loc[['a','c'],['학번','성별']]

ex_c_name        학번 성별
ex_i_name
a          20203300  여
c          20203302  여

In [53]:
#df options 

df1.reindex(columns = ['이름','학번','성별','학점'])
df1

ex_c_name        학번    이름        학점 성별
ex_i_name
a          20203300   풍유성  3.532963  여
b          20203301  제갈영윤  4.272661  남
c          20203302   설현우  3.945900  여
d          20203303   백태하  4.396391  여
e          20203304   정용성  4.063440  남
f          20203305   허형철  3.064323  여
g          20203306   하주연  3.554681  여
h          20203307  사공재주  3.617575  여
i          20203308   손창희  3.117372  남
j          20203309   유용환  3.778316  여

In [62]:
# Common Mistakes
df1.loc[df1['성별'] == '여'] = 10
df1

         학번    이름         학점  성별
a        10    10  10.000000  10
b  20203301  제갈영윤   3.684356   남
c  20203302   설현우   3.289410   남
d  20203303   백태하   4.065680   남
e        10    10  10.000000  10
f        10    10  10.000000  10
g  20203306   하주연   4.101153   남
h        10    10  10.000000  10
i  20203308   손창희   4.304477   남
j        10    10  10.000000  10

In [65]:
df1 = {
    '학번' : np.arange(20203300, 20203310),
    '이름' : ['풍유성', '제갈영윤', '설현우', '백태하', '정용성', '허형철', '하주연', '사공재주', '손창희', '유용환'],
    '학점' : np.random.uniform(3, 4.5, 10),
    '성별' : np.random.choice(['남','여'], 10)
}
df1 = pd.DataFrame(df1)
df1.index = list('abcdefghij')
df1

         학번    이름        학점 성별
a  20203300   풍유성  3.854855  남
b  20203301  제갈영윤  4.022433  남
c  20203302   설현우  3.351779  남
d  20203303   백태하  3.278073  남
e  20203304   정용성  4.498294  남
f  20203305   허형철  3.638693  여
g  20203306   하주연  3.629186  여
h  20203307  사공재주  3.663580  여
i  20203308   손창희  4.011899  여
j  20203309   유용환  4.112367  남

In [66]:
df1.loc[df1['성별'] == '여', '학점'] = 100
df1

         학번    이름          학점 성별
a  20203300   풍유성    3.854855  남
b  20203301  제갈영윤    4.022433  남
c  20203302   설현우    3.351779  남
d  20203303   백태하    3.278073  남
e  20203304   정용성    4.498294  남
f  20203305   허형철  100.000000  여
g  20203306   하주연  100.000000  여
h  20203307  사공재주  100.000000  여
i  20203308   손창희  100.000000  여
j  20203309   유용환    4.112367  남

In [67]:
df2 = {
    '학번' : np.arange(20203300, 20203310),
    '이름' : ['풍유성', '제갈영윤', '설현우', '백태하', '정용성', '허형철', '하주연', '사공재주', '손창희', '유용환'],
    '학점' : np.random.uniform(3, 4.5, 10),
    '성별' : np.random.choice(['남','여'], 10)
}
df2 = pd.DataFrame(df2)
df2.index = list('abcdefghij')
df2

         학번    이름        학점 성별
a  20203300   풍유성  3.015180  남
b  20203301  제갈영윤  3.458577  남
c  20203302   설현우  3.895026  남
d  20203303   백태하  3.940790  여
e  20203304   정용성  3.081079  여
f  20203305   허형철  4.164526  여
g  20203306   하주연  3.661090  남
h  20203307  사공재주  3.073902  여
i  20203308   손창희  3.713323  남
j  20203309   유용환  4.493975  여

In [74]:
df3 = df1+df2
df3

         학번        이름          학점  성별
a  40406600    풍유성풍유성    6.870035  남남
b  40406602  제갈영윤제갈영윤    7.481010  남남
c  40406604    설현우설현우    7.246805  남남
d  40406606    백태하백태하    7.218863  남여
e  40406608    정용성정용성    7.579373  남여
f  40406610    허형철허형철  104.164526  여여
g  40406612    하주연하주연  103.661090  여남
h  40406614  사공재주사공재주  103.073902  여여
i  40406616    손창희손창희  103.713323  여남
j  40406618    유용환유용환    8.606341  남여

In [78]:
# how to apply column 
def assign_grade(gender):
    return 2 if gender == '남' else 4

# 새로운 '학년' 열 추가
df2['학년'] = df2['성별'].apply(assign_grade)

In [79]:
df2

         학번    이름        학점 성별  학년
a  20203300   풍유성  3.015180  남   2
b  20203301  제갈영윤  3.458577  남   2
c  20203302   설현우  3.895026  남   2
d  20203303   백태하  3.940790  여   4
e  20203304   정용성  3.081079  여   4
f  20203305   허형철  4.164526  여   4
g  20203306   하주연  3.661090  남   2
h  20203307  사공재주  3.073902  여   4
i  20203308   손창희  3.713323  남   2
j  20203309   유용환  4.493975  여   4

In [80]:
# if there is no common point in index or column
df4 = pd.DataFrame({"A": [1, 2]})
df5 = pd.DataFrame({"B": [3, 4]})

In [81]:
df4+df5

    A   B
0 NaN NaN
1 NaN NaN

In [82]:
df6 = pd.DataFrame({"A": [5, 7]})
df4+df6

   A
0  6
1  9

In [100]:
df7 = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = list('ABC'),
                   columns = list('1234'))
df7

   1  2   3   4
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [101]:
df8 = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = list('CDE'),
                   columns = list('3456'))
df8

   3  4   5   6
C  0  1   2   3
D  4  5   6   7
E  8  9  10  11

In [102]:
# is there no common portion, it fills nan
df7+df8

    1   2     3     4   5   6
A NaN NaN   NaN   NaN NaN NaN
B NaN NaN   NaN   NaN NaN NaN
C NaN NaN  10.0  12.0 NaN NaN
D NaN NaN   NaN   NaN NaN NaN
E NaN NaN   NaN   NaN NaN NaN

In [104]:
# use fill_value option nan -> fill_value
df7.add(df8, fill_value=0)

     1    2     3     4     5     6
A  0.0  1.0   2.0   3.0   NaN   NaN
B  4.0  5.0   6.0   7.0   NaN   NaN
C  8.0  9.0  10.0  12.0   2.0   3.0
D  NaN  NaN   4.0   5.0   6.0   7.0
E  NaN  NaN   8.0   9.0  10.0  11.0

In [106]:
# calculation with series

In [107]:
df7

   1  2   3   4
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [114]:
ser5 = pd.Series(np.arange(3),
                 index = list('ABC'))
ser6 = pd.Series(np.arange(4),
                 index = list('1234'))
print(ser5)
print(ser6)

A    0
B    1
C    2
dtype: int32
1    0
2    1
3    2
4    3
dtype: int32

In [115]:
df7+ser6

   1   2   3   4
A  0   2   4   6
B  4   6   8  10
C  8  10  12  14

In [120]:
df7.add(ser6, axis=1)
# == df7.add(ser6, axis='columns')

   1   2   3   4
A  0   2   4   6
B  4   6   8  10
C  8  10  12  14

In [121]:
df7.add(ser6, axis=0)

    1   2   3   4
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
4 NaN NaN NaN NaN
A NaN NaN NaN NaN
B NaN NaN NaN NaN
C NaN NaN NaN NaN

In [122]:
df7

   1  2   3   4
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [123]:
df7.sum(axis='index')

1    12
2    15
3    18
4    21
dtype: int64

In [124]:
df7.sum(axis='columns')

A     6
B    22
C    38
dtype: int64

In [130]:
df7.sort_index(ascending=False)

   1  2   3   4
C  8  9  10  11
B  4  5   6   7
A  0  1   2   3

In [132]:
df2

         학번    이름        학점 성별  학년
a  20203300   풍유성  3.015180  남   2
b  20203301  제갈영윤  3.458577  남   2
c  20203302   설현우  3.895026  남   2
d  20203303   백태하  3.940790  여   4
e  20203304   정용성  3.081079  여   4
f  20203305   허형철  4.164526  여   4
g  20203306   하주연  3.661090  남   2
h  20203307  사공재주  3.073902  여   4
i  20203308   손창희  3.713323  남   2
j  20203309   유용환  4.493975  여   4

In [134]:
df2.sort_values(by='학점')

         학번    이름        학점 성별  학년
a  20203300   풍유성  3.015180  남   2
h  20203307  사공재주  3.073902  여   4
e  20203304   정용성  3.081079  여   4
b  20203301  제갈영윤  3.458577  남   2
g  20203306   하주연  3.661090  남   2
i  20203308   손창희  3.713323  남   2
c  20203302   설현우  3.895026  남   2
d  20203303   백태하  3.940790  여   4
f  20203305   허형철  4.164526  여   4
j  20203309   유용환  4.493975  여   4

In [135]:
df2.sort_index(axis='index',ascending=False)

         학번    이름        학점 성별  학년
j  20203309   유용환  4.493975  여   4
i  20203308   손창희  3.713323  남   2
h  20203307  사공재주  3.073902  여   4
g  20203306   하주연  3.661090  남   2
f  20203305   허형철  4.164526  여   4
e  20203304   정용성  3.081079  여   4
d  20203303   백태하  3.940790  여   4
c  20203302   설현우  3.895026  남   2
b  20203301  제갈영윤  3.458577  남   2
a  20203300   풍유성  3.015180  남   2

In [136]:
df2.rank(method='first')

     학번    이름    학점    성별    학년
a   1.0   8.0   1.0   1.0   1.0
b   2.0   7.0   4.0   2.0   2.0
c   3.0   3.0   7.0   3.0   3.0
d   4.0   1.0   8.0   6.0   6.0
e   5.0   6.0   3.0   7.0   7.0
f   6.0  10.0   9.0   8.0   8.0
g   7.0   9.0   5.0   4.0   4.0
h   8.0   2.0   2.0   9.0   9.0
i   9.0   4.0   6.0   5.0   5.0
j  10.0   5.0  10.0  10.0  10.0

In [137]:
# dataframe can allow redundancy

In [140]:
df8 = pd.DataFrame(df2.values,
                   df2.index,
                   df2.columns)

In [142]:
df8.index = list('abbcaccbab')

In [143]:
df8

         학번    이름        학점 성별 학년
a  20203300   풍유성   3.01518  남  2
b  20203301  제갈영윤  3.458577  남  2
b  20203302   설현우  3.895026  남  2
c  20203303   백태하   3.94079  여  4
a  20203304   정용성  3.081079  여  4
c  20203305   허형철  4.164526  여  4
c  20203306   하주연   3.66109  남  2
b  20203307  사공재주  3.073902  여  4
a  20203308   손창희  3.713323  남  2
b  20203309   유용환  4.493975  여  4

In [144]:
df8.loc['a']

         학번   이름        학점 성별 학년
a  20203300  풍유성   3.01518  남  2
a  20203304  정용성  3.081079  여  4
a  20203308  손창희  3.713323  남  2